from itertools import *


c = 0
for x in product('0123456789ABCDE', repeat=5):
    s = ''.join(x)
    if s[0] != '0':
        d1 = []
        d1.append(int(s[0], 15) % 2 == 0)
        d1.append(int(s[1], 15) % 3 == 0)
        d1.append(int(s[2], 15) % 2 == 0)
        d1.append(int(s[3], 15) % 3 == 0)
        d1.append(int(s[4], 15) % 2 == 0)
        d2 = []
        d2.append(int(s[0], 15) % 3 == 0)
        d2.append(int(s[1], 15) % 2 == 0)
        d2.append(int(s[2], 15) % 3 == 0)
        d2.append(int(s[3], 15) % 2 == 0)
        d2.append(int(s[4], 15) % 3 == 0)
        if any([all(d1), all(d2)]):
            c += 1

print(c)
# 17438 ответ верный
# Сколько существует 5-разрядных пятнадцатеричных чисел, в которых разряды, делящиеся на 2 без остатка,
# и разряды, делящиеся на 3 без остатка, чередуются?
#
# Например, число 40068 подходит под описание, число 40086 — нет.